[
  "Tell me about yourself.",
  "What motivated you to apply for this role?",
  "What are your greatest strengths?",
  "What are your greatest weaknesses?",
  "Why are you interested in working for our company?",
  "How do you stay updated with the latest industry trends?",
  "Describe a challenging project you have worked on.",
  "How do you manage deadlines and multiple priorities?",
  "Can you describe a time when you had to learn a new technology quickly?",
  "What do you consider your biggest professional achievement?",
  "How do you handle conflicts within a team?",
  "Describe your ideal work environment.",
  "How do you approach problem-solving in your work?",
  "Can you tell me about a time you made a mistake and how you handled it?",
  "How do you prioritize tasks when everything seems urgent?",
  "What are your career aspirations for the next five years?",
  "What motivates you to perform at your best?",
  "How do you handle stress and pressure at work?",
  "Describe a time when you had to work under a tight deadline.",
  "What role do you usually take in team projects?",
  "How do you communicate technical concepts to non-technical colleagues?",
  "Can you explain a complex technical problem you solved?",
  "What are your expectations from this role?",
  "How do you ensure the quality of your code?",
  "What programming languages are you most comfortable with?",
  "How do you stay current with new programming languages and technologies?",
  "What do you think are the key qualities of a successful developer?",
  "How do you approach debugging a difficult issue?",
  "Can you describe a time when you received constructive criticism and how you responded?",
  "What are your thoughts on remote work and collaboration?",
  "How do you keep yourself organized during a project?",
  "What is your experience with agile methodologies?",
  "How do you handle changes in project requirements?",
  "What do you do when you are stuck on a technical problem?",
  "Can you give an example of how you have contributed to improving a process or product?",
  "How do you balance quality and speed in your work?",
  "What role does testing play in your development process?",
  "How do you ensure your work aligns with business goals?",
  "Can you discuss a time when you had to work with a difficult colleague?",
  "Why do you believe you are a good fit for this role?"
]
