[
  "Can you tell me about yourself and your experience as a Java developer?",
  "What interests you about this role and our company?",
  "What versions of Java have you worked with, and what are the key differences between them?",
  "Can you explain the differences between Java SE, Java EE, and Spring Boot?",
  "How do you handle memory management in Java?",
  "What are the differences between String, StringBuilder, and StringBuffer?",
  "What is the difference between checked and unchecked exceptions in Java?",
  "Can you explain how garbage collection works in Java?",
  "What is the difference between the Heap and Stack memory in Java?",
  "How do you ensure your Java application is thread-safe?",
  "What are the main principles of Object-Oriented Programming (OOP) and how do they apply in Java?",
  "Can you explain the difference between an abstract class and an interface?",
  "What is dependency injection and how does Spring Boot implement it?",
  "What are Spring Boot annotations, and which ones have you used the most?",
  "Can you explain the lifecycle of a Spring Bean?",
  "What is the difference between @Component, @Service, and @Repository in Spring Boot?",
  "What is Hibernate, and how does it differ from JDBC?",
  "What are the advantages of using JPA instead of plain JDBC?",
  "Can you explain the difference between eager and lazy loading in Hibernate?",
  "What are transactions in Java, and how does Spring handle them?",
  "How do you optimize database queries in a Java application?",
  "What is the difference between REST and SOAP APIs?",
  "How do you implement a RESTful API in Spring Boot?",
  "What are the HTTP methods used in REST, and when should each be used?",
  "How do you handle authentication and authorization in a Java-based web application?",
  "What is OAuth 2.0, and how have you used it in a Java application?",
  "Can you explain the difference between authentication and authorization?",
  "How do you implement logging in a Java application?",
  "What is the difference between JUnit and TestNG?",
  "How do you write unit tests in Java using JUnit 5?",
  "What is mocking in Java testing, and how do you use Mockito?",
  "Can you explain the difference between integration testing and unit testing?",
  "What is CI/CD, and how have you implemented it in a Java project?",
  "Have you worked with containerization tools like Docker or Kubernetes for deploying Java applications?",
  "How do you handle version control in Java projects?",
  "Can you describe a challenging bug you encountered in a Java application and how you resolved it?",
  "How do you ensure a Java application performs well under high traffic?",
  "What design patterns have you used in Java development?",
  "How do you approach multi-threading and concurrency in Java applications?",
  "Where do you see yourself in five years in your career as a Java developer?"
]
