[
  "Can you tell me about your experience working with Spring Boot?",
  "What are the advantages of using Spring Boot over traditional Spring Framework?",
  "Can you explain how dependency injection works in Spring Boot?",
  "What is the difference between @Component, @Service, and @Repository annotations?",
  "What is the role of @Autowired in Spring Boot?",
  "How do you configure a Spring Boot application without an XML file?",
  "What is the difference between @RestController and @Controller in Spring Boot?",
  "How do you handle exception management in Spring Boot?",
  "What is the difference between @Transactional and programmatic transaction management?",
  "Can you explain the purpose of Spring Boot starters?",
  "How does Spring Boot handle property management and externalized configuration?",
  "What are the main differences between Spring Boot and Spring MVC?",
  "How does Spring Boot implement aspect-oriented programming (AOP)?",
  "Can you explain the use of @Configuration and @Bean annotations?",
  "What is the difference between application.properties and application.yml?",
  "How do you handle database migrations in a Spring Boot application?",
  "What is Hibernate, and how does it integrate with Spring Boot?",
  "Can you explain the difference between JPA and Hibernate?",
  "What is the role of @Entity, @Table, @Id, and @GeneratedValue annotations in JPA?",
  "What is the purpose of the @Query annotation in Spring Data JPA?",
  "What is the difference between findById() and getOne() in Spring Data JPA?",
  "How do you handle pagination and sorting in Spring Data JPA?",
  "What are the key security features provided by Spring Security?",
  "How do you implement JWT-based authentication in a Spring Boot application?",
  "Can you explain the difference between authentication and authorization in Spring Security?",
  "How do you secure a REST API using Spring Security?",
  "What is OAuth2, and how have you implemented it in Spring Boot?",
  "How do you enable CORS in a Spring Boot application?",
  "What is the role of @EnableWebSecurity annotation?",
  "How does Spring Boot support microservices architecture?",
  "What is the purpose of Spring Cloud, and have you used it in any projects?",
  "How do you implement service discovery with Eureka in Spring Boot?",
  "What is Spring Boot Actuator, and how do you use it?",
  "How do you monitor and log a Spring Boot application?",
  "How do you implement caching in Spring Boot?",
  "What are some common performance optimization strategies for a Spring Boot application?",
  "What is the difference between @Scheduled and @Async annotations in Spring Boot?",
  "How do you integrate a Spring Boot application with Kafka or RabbitMQ?",
  "What are some best practices you follow when developing a Spring Boot application?"
]
